ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_scps.c
    Cy_BLE_SCPS_ApplCallback = callbackFunc;
    if(cy_ble_scpsConfigPtr != NULL)
    {
        cy_ble_scpsConfigPtr->callbackFunc = callbackFunc;
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
    
    return(apiResult);
}


#ifdef CY_BLE_SCPS_SERVER


/******************************************************************************
* Function Name: Cy_BLE_SCPSS_SetCharacteristicValue
***************************************************************************//**
*
*  Sets a characteristic value of the Scan Parameters service, which is
*  identified by charIndex.
*
*  \param charIndex: The index of the service characteristic.
*              * CY_BLE_SCPS_SCAN_INT_WIN - The Scan Interval Window characteristic index
*              * CY_BLE_SCPS_SCAN_REFRESH - The Scan Refresh characteristic index
*
*  \param attrSize: The size of the characteristic value attribute.
*
*  \param attrValue: The pointer to the characteristic value data that should be
*               stored to the GATT database.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The request handled successfully
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed
*   * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - An optional characteristic is absent
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_SCPSS_SetCharacteristicValue(cy_en_ble_scps_char_index_t charIndex,
                                                           uint8_t attrSize,
                                                           uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    cy_ble_gatt_db_attr_handle_t charValueHandle;
    uint16_t scanInterval;
    uint16_t locScanWindow;

    if(charIndex >= CY_BLE_SCPS_CHAR_COUNT)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        if(charIndex == CY_BLE_SCPS_SCAN_INT_WIN)
        {
            scanInterval = Cy_BLE_Get16ByPtr(attrValue);
            locScanWindow = Cy_BLE_Get16ByPtr(attrValue + sizeof(scanInterval));
            if((scanInterval < CY_BLE_SCAN_INTERVAL_WINDOW_MIN) || (scanInterval > CY_BLE_SCAN_INTERVAL_WINDOW_MAX) ||
               (locScanWindow < CY_BLE_SCAN_INTERVAL_WINDOW_MIN) || (locScanWindow > scanInterval) ||
               (attrSize > CY_BLE_INTERVAL_WINDOW_CHAR_LEN))
            {
                apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
            }
            else
            {
                charValueHandle = cy_ble_scpsConfigPtr->scpss->intervalWindowCharHandle;
            }
        }
        else    /* Scan Refresh characteristic */
        {
            if(attrSize > CY_BLE_REFRESH_CHAR_LEN)
            {
                apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
            }
            else
            {
                charValueHandle = cy_ble_scpsConfigPtr->scpss->refreshCharHandle;
            }
        }
    }
    if(apiResult == CY_BLE_SUCCESS)
    {
        if(charValueHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
        else
        {
            /* Store data in database */
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair.attrHandle = charValueHandle,
                .handleValuePair.value.len  = attrSize,
                .handleValuePair.value.val  = attrValue,
                .offset                     = 0u,
                .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
            };

            if(Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
            {
                apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
            }
        }
    }

    return(apiResult);
}


/*******************************************************************************
* Function Name: Cy_BLE_SCPSS_GetCharacteristicValue
****************************************************************************//**
*
*  Gets a characteristic value of the Scan Parameters service, which is identified
*  by charIndex.
*
*  \param charIndex: The index of the service characteristic.
*             * CY_BLE_SCPS_SCAN_INT_WIN - The Scan Interval Window characteristic index
*             * CY_BLE_SCPS_SCAN_REFRESH - The Scan Refresh characteristic index
*
*  \param attrSize: The size of the characteristic value attribute.
*
*  \param attrValue: The pointer to the location where characteristic value data
*               should be stored.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request handled successfully
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - Optional characteristic is absent
*
*
*******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_SCPSS_GetCharacteristicValue(cy_en_ble_scps_char_index_t charIndex,
                                                           uint8_t attrSize,
                                                           uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    cy_ble_gatt_db_attr_handle_t charValueHandle;

    if(charIndex >= CY_BLE_SCPS_CHAR_COUNT)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        if(charIndex == CY_BLE_SCPS_SCAN_INT_WIN)
        {
            if(attrSize > CY_BLE_INTERVAL_WINDOW_CHAR_LEN)
            {
                apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
            }
            else
            {
                charValueHandle = cy_ble_scpsConfigPtr->scpss->intervalWindowCharHandle;
            }
        }
        else    /* Scan Refresh characteristic */
        {
            if(attrSize > CY_BLE_REFRESH_CHAR_LEN)
            {
                apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
            }
            else
            {
                charValueHandle = cy_ble_scpsConfigPtr->scpss->refreshCharHandle;
            }
        }
    }
    if(apiResult == CY_BLE_SUCCESS)
    {
        if(charValueHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
        else
        {
            /* Read characteristic value from database */
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair.attrHandle = charValueHandle,
                .handleValuePair.value.len  = attrSize,
                .handleValuePair.value.val  = attrValue,
                .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
            };

            if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
            {
                apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
            }
        }
    }

    return(apiResult);
}


