ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_scps.c
/*******************************************************************************
* Function Name: Cy_BLE_SCPSS_GetCharacteristicDescriptor
****************************************************************************//**
*
*  Gets a characteristic descriptor of the specified characteristic of the
*  Scan Parameters service.
*
*  \param connHandle: The connection handle
*  \param charIndex: The index of the characteristic.
*             * CY_BLE_SCPS_SCAN_REFRESH - The Scan Refresh characteristic index
*
*  \param descrIndex: The index of the descriptor.
*             * CY_BLE_SCPS_SCAN_REFRESH_CCCD - The Client Characteristic
*                Configuration descriptor index of the Scan Refresh characteristic
*
*  \param attrSize: The size of the characteristic value attribute.
*
*  \param attrValue: The pointer to the location where the characteristic descriptor
*               value data should be stored.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request handled successfully
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - Optional descriptor is absent
*
*******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_SCPSS_GetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                                cy_en_ble_scps_char_index_t charIndex,
                                                                cy_en_ble_scps_descr_index_t descrIndex,
                                                                uint8_t attrSize,
                                                                uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;

    if((charIndex != CY_BLE_SCPS_SCAN_REFRESH) || (descrIndex >= CY_BLE_SCPS_DESCR_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        if(cy_ble_scpsConfigPtr->scpss->refreshCccdHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
        else
        {
            /* Get data from database */
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair.attrHandle = cy_ble_scpsConfigPtr->scpss->refreshCccdHandle,
                .handleValuePair.value.len  = attrSize,
                .handleValuePair.value.val  = attrValue,
                .connHandle                 = connHandle,
                .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
            };

            if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
            {
                apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
            }
        }
    }

    return(apiResult);
}


/*******************************************************************************
* Function Name: Cy_BLE_SCPSS_WriteEventHandler
****************************************************************************//**
*
*  Handles the Write Request Event for the service.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
* \return
*  Return value is of type cy_en_ble_gatt_err_code_t.
*   * CY_BLE_GATT_ERR_NONE - Write request handled successfully.
*   * CY_BLE_GATT_ERR_UNLIKELY_ERROR - Internal error while writing attribute value
*
*******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_SCPSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;
    cy_stc_ble_scps_char_value_t locChar = { .connHandle = eventParam->connHandle };

    if(Cy_BLE_SCPS_ApplCallback != NULL)
    {
        if((eventParam->handleValPair.attrHandle == cy_ble_scpsConfigPtr->scpss->refreshCccdHandle) ||
           (eventParam->handleValPair.attrHandle == cy_ble_scpsConfigPtr->scpss->intervalWindowCharHandle))
        {
            /* Store value to database */
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair = eventParam->handleValPair,
                .connHandle      = eventParam->connHandle,
                .offset          = 0u,
                .flags           = CY_BLE_GATT_DB_PEER_INITIATED
            };

            gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);
            if(gattErr == CY_BLE_GATT_ERR_NONE)
            {
                /* Client Characteristic Configuration descriptor write request */
                if(eventParam->handleValPair.attrHandle == cy_ble_scpsConfigPtr->scpss->refreshCccdHandle)
                {
                    uint32_t eventCode;
                    locChar.charIndex = CY_BLE_SCPS_SCAN_REFRESH;
                    locChar.value = NULL;

                    if(CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                    {
                        eventCode = (uint32_t)CY_BLE_EVT_SCPSS_NOTIFICATION_ENABLED;
                    }
                    else
                    {
                        eventCode = (uint32_t)CY_BLE_EVT_SCPSS_NOTIFICATION_DISABLED;
                    }
                    Cy_BLE_SCPS_ApplCallback(eventCode, &locChar);

                #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && \
                    (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))

                    /* Set flag to store bonding data to flash */
                    if(cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING)
                    {
                        cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
                    }
                #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */
                }
                else /* Scan Interval Window characteristic write without response request */
                {
                    locChar.charIndex = CY_BLE_SCPS_SCAN_INT_WIN;
                    locChar.value = &eventParam->handleValPair.value;
                    Cy_BLE_SCPS_ApplCallback((uint32_t)CY_BLE_EVT_SCPSS_SCAN_INT_WIN_WRITE_CHAR, &locChar);
                }
            }
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
    }

    return(gattErr);
}


